
def area(a):
    '''
    Вычисляет площадь квадрата по его стороне.

    Параметры:
        a (int | float) :  Сторона квадрата.
    
    Возврат:
        area (int | float) : Площадь квадрата.

    Пример:
        area(10) -> 100
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата по его стороне.

    Параметры:
        a (int | float) :  Сторона квадрата.
    
    Возврат:
        perimeter (int | float) : Периметр квадрата.

    Пример:
        perimeter(10) -> 40
    '''
    return 4 * a
