def area(a):
    '''
    Вычисляет площадь квадрата по его стороне.

    Параметры:
        a (число) :  Сторона квадрата.
    
    Возврат:
        area (число) : Площадь квадрата.

    Пример:
        area(10) -> 100
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата по его стороне.

    Параметры:
        a (число) :  Сторона квадрата.
    
    Возврат:
        perimeter (число) : Периметр квадрата.

    Пример:
        perimeter(10) -> 40
    '''
    return 4 * a